Revit 2027 API
BuiltInFailures.SteelElementFailures Class
 Failures about steel elements
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SteelElementFailures
Public NotInheritable Class SteelElementFailures
public ref class SteelElementFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SteelElementFailures = class end
The BuiltInFailures.SteelElementFailures type exposes the following members.
Properties
Name | Description
SteelElementModifyParametersTaskNotFinished |  Cannot modify parameters while background calculations are in progress.
SteelElementModifyRangesTaskNotFinished |  Cannot modify ranges while background calculations are in progress.
SteelElementPreviewTaskNotFinished |  Cannot create preview while background calculations are in progress.
SteelElementPropagationTaskNotFinished |  Advance Steel propagation tasks not finished.
SteelElementTaskNotFinished |  Advance Steel tasks not finished.
Top
See Also
Reference
Autodesk.Revit.DB Namespace